[
    {
       "id":"1",
       "name":"A_Rival",
       "description":"chip-hop defined...electronic rap at its rawest",
       "bio":"While many musicians continue to struggle to find their niche, in a few short years A_Rival established himself as a game industry renaissance man by developing a loyal following and fanbase from the national electronic gaming community through multiple means.\n\nAs, not only, a well-regarded \"Street Fighter gaming competitor\", A_Rival is best known for composing multiple soundtracks for Nokia's, now defunct, gaming division, as well as the title-screen music for Capcom's XBOX Live! \"Super Street Fighter II HD Remix.\" A_Rival's remix of Clamato Fever is one of the most popular game music tracks on YouTube.com, having received hundreds of thousands of 'plays' to date.\n\nHis industry connections lead him to quickly develop and promote his underground performer persona, A_Rival, and his 8-bit infused \"Chip-Hop\" sound directly at those individuals who would become the core of his fanbase: The Electronic Gaming Community. Through his numerous industry connections and the ability to put on a riveting stage show, in under a year, A_Rival's stature in the gaming industry is that of a leading and in-demand performer at the biggest public and corporate parties held during the foremost Electronic Gaming Expositions in America, including MagFest, PAX (Penny Arcade Expo) and E3, and for corporations such as Microsoft.\n\nIn conclusion, Paul Lipson states, \"A_Rival stands at the apex of video game history and new music innovation. The revolution is well underway, and it has an 8-Bit champion changing all the rules and setting the pace!\"\n\nFor more A_Rival info, please visit www.planetskill.com or www.myspace.com\/8bitpimp.",
       "photo":"http:\/\/magnatune.com\/artists\/img\/a_rival.jpg",
       "albums":[
          {
             "id":"1",
             "artist_id":"1",
             "name":"8-Bit Pimp",
             "description":"From Game music producer, composer, and performer A_Rival comes \"8-Bit Pimp\"; the first full-length, Hip-Hop album of all original music in where all tracks and beats were composed entirely using the sound chip of the Nintendo Entertainment System. A_Rival is quickly bridging the gap between Hip-Hop and the up-and-coming \"Chiptune\" scene - an emerging music genre established in San Francisco among DJs, composers, producers, and musically inclined fans of game music that seeks to push the boundaries of the art form.\n",
             "cover":"http:\/\/he3.magnatune.com\/music\/A_Rival\/8-Bit Pimp\/cover_400.jpg",
             "cover_small":"http:\/\/he3.magnatune.com\/music\/A_Rival\/8-Bit Pimp\/cover_200.jpg",
             "release_date":"1283583600",
             "popularity":"6"
          }
       ]
    },
    {
       "id":"2",
       "name":"Abbas Premjee",
       "description":"A fusion of rock and jazz from the East and the West that brings minds, hearts and souls together",
       "bio":"The music of Abbas Premjee spans many genres, from rock and blues to world and classical.\n\nAbbas has had an undeniable passion for music since an early age. He started playing guitar at 10 and remained largely self-taught until the time he began to formally study music. During his initial years, he played guitar for several rock and jazz bands. It was during this time that he was exposed to classical guitar, which led him to decide to study music formally.\n\nHe completed his Bachelors degree in Music theory and composition from Loyola Marymount University, and then his Masters degree in Classical Guitar from Southern Methodist University, where he studied under Robert Guthrie. A few years later, he returned to Pakistan and opened a recording studio and production house, working with local talent and producing music for TV. As Abbas later realized, coming back to Pakistan was an essential step in his musical growth as it led to his discovery of Indian Classical music. Here he found a world rich in expression. A world unknown to his Western ears. Keen to learn this new language, he took up the Mohan veena, a modern hybrid between a guitar and a sitar, and took instruction in from the legendary sitar player, Ustad Rais Khan.\n\nHaving lived the life of a classical musician on both sides of the fence, and as a rock and jazz musician earlier, Abbas thought of a world where all these expressions could live together. This led to his first CD \"Elements\", on which he collaborated with some of the finest talent in Pakistan. \"Elements\" was released in Pakistan in 2008. It was met with great enthusiasm and very positive reviews in some of the leading newspapers, vastly increasing the scope of music available to the people of Pakistan and introducing them to the subtleties of jazz and classical guitar built on ragas and drones. This was followed by the release of \"Crescent Moon\" in 2011, in which he featured the Mohan veena. Both these albums successfully combined the beauty and grace of the ragas with contemporary sounds and grooves from the rock and jazz genres.\n\nIn 2009, Abbas returned to the United States and has since taken up residence in Irvine, CA where he is active as a composer for media, a teacher, as well as a performer on the mohan veena.",
       "photo":"http:\/\/magnatune.com\/artists\/img\/abbas_premjee.jpg",
       "albums":[
          {
             "id":"2",
             "artist_id":"2",
             "name":"Crescent Moon",
             "description":"Each track on this album has been written with the help of Indian ragas: scalar and melodic patterns that convey distinct essences of emotions. To this, I have added sounds of rock, jazz and whatever else that came in my mind. The combination works.\n\nA host of influences have converged here ranging from the ancient sounds of Indian ragas to contemporary hip-hop beats. The result is sometimes hypnotic and sometimes melancholic. Our ancestors had a much deeper connection with music than we do, on a spiritual and emotional level. I would like to reestablish that connection.\n\nCrescent Moon features the mohan veena, a modern version of an ancient Indian instrument. The mohan veena, being a slide instrument, possesses the ability to play microtonally and bring out the true nature of the ragas.\n\n",
             "cover":"http:\/\/he3.magnatune.com\/music\/Abbas Premjee\/Crescent Moon\/cover_400.jpg",
             "cover_small":"http:\/\/he3.magnatune.com\/music\/Abbas Premjee\/Crescent Moon\/cover_200.jpg",
             "release_date":"1360742400",
             "popularity":"59"
          }
       ]
    },
    {
       "id":"3",
       "name":"Adam Fielding",
       "description":"atmospheric dance music with cool vocals",
       "bio":"Adam Fielding is a UK based electronic musician specialising in blending rich soundscapes with strong melodies to create music that is both diverse and accessible, while retaining a strong emotional undercurrent. 2008 saw the release of his debut album \"Distant Activity\", in which Adam combined elements of atmospheric electronica with dance, shoegaze and symphonic sensibilities to create a unique musical experience.\n\nAdam first started writing music at a young age in the mid-90s using a combination of an Atari STe and Protracker - free software released for the sole purpose of creating music on home computers. Although originally being more interested in computer programming than music, this dabbling with music would later go from being a mere hobby to becoming a passion for all things musical.\n\nAlthough Adam's earlier tracks were geared more towards industrial and VGM styles while taking an interest in metal and post-hardcore music, his style would later evolve to encompass a wide variety of sub-genres including dance, ambient, synthpop, downtempo, breaks and neo-classical styles while retaining his unique production style and melodic focus. While studying as a music production student at the University of Huddersfield, Adam began to experiment with incorporating vocals and guitar elements into his music proper, with the former becoming a key element in many of his songs.\n\nAdam has also used his writing and production skills in other projects, including sound design and freelance composition projects for various companies as well as having his music licensed by various firms and individuals. Adam has also worked on various collaborations and remixes with other like-minded musicians.\n\nVisit Adam Fielding on the web at www.adamfielding.com.",
       "photo":"http:\/\/magnatune.com\/artists\/img\/fielding2.jpg",
       "albums":[
          {
             "id":"3",
             "artist_id":"3",
             "name":"Distant Activity",
             "description":"In late 2007, during the creation of The Dawn EP I became more and more interested with merging familiar styles of synthpop, downtempo and ambient music with a more progressive, semi-breaks driven sound. I had been writing music in a similar sort of vein since late 2006, and after experimenting with a more chilled sound decided that this was absolutely the direction I wanted to pursue for my first full length release. I was becoming more and more fascinated by melody-driven dance music at the time and decided to fuse this with my already existing synthpop\/atmospheric-driven sound.\n\nThe album really started to take form with the production of the title track in January 2008. The bulk of the production occurred during my placement year at university, working primarily within my humble bedroom studio at the time which essentially consisted of me, my laptop, Reason 4, an orchestral sound kit, a microphone and a guitar. As the album continued to take shape I found myself drawn towards themes of finding beauty in darkness as well as light, isolation and redemption. This led to the album taking on a heavily introspective, contemplative tone, forming a steady emotional undercurrent to the album itself.\n\nThe songs themselves were taken from a mixture of existing tracks (re-worked to fit with the style and mood of the album) and new tracks written and produced during 2007-2008. I sent the album as-is to several labels during its creation and, after receiving little to no response, decided to stop wasting my time and release the album independently initially. I genuinely believed I had created a body of work that suitably summed up my influences and experiences prior to that point, and was desperate to share it with anyone who wanted to listen. A combination of Magnatune, CDBaby and a short-run CD copy provided me with the means to get my music out there to anyone who wanted to listen. I decided to focus my efforts on what I knew best - writing and producing music. At the time I didn't fully appreciate the amount of work and effort that would go into releasing a record independently, but I'm still incredibly glad I did.\n\nDistant Activity was officially released in September 2008, just before I commenced my final year at university. Things came full circle when it was picked up and re-released digitally through Distinctive Records in late 2010. A selection of out-takes from the Distant Activity production sessions was released on March 7th 2012 as the free EP Background Activity.\n",
             "cover":"http:\/\/he3.magnatune.com\/music\/Adam Fielding\/Distant Activity\/cover_400.jpg",
             "cover_small":"http:\/\/he3.magnatune.com\/music\/Adam Fielding\/Distant Activity\/cover_200.jpg",
             "release_date":"1220770800",
             "popularity":"32"
          },
          {
             "id":"4",
             "artist_id":"3",
             "name":"Lightfields",
             "description":"Building on his debut album \"Distant Activity\", Adam weaves a delicate balance of incredible production prowess, live instrumentation and emotional songwriting, resulting in a remarkably accessible listen while boasting a startling amount of depth. From the driven, mangled beats of The Initiation through to the off-kilter synth-rock of The Same Mistakes, listeners are treated to a consistently organic record with more than a few surprises along the way.\n\nLightfields strikes a creative balance between artistic development, memorable songwriting and accessibility, resulting in an album that revels in cutting-edge production and artistic expression.\n\nLightfields is the sophomore artist album of UK-based electronic musician Adam Fielding, written and recorded from 2008-2010 and released in September 2010.\n",
             "cover":"http:\/\/he3.magnatune.com\/music\/Adam Fielding\/Lightfields\/cover_400.jpg",
             "cover_small":"http:\/\/he3.magnatune.com\/music\/Adam Fielding\/Lightfields\/cover_200.jpg",
             "release_date":"1284188400",
             "popularity":"34"
          },
          {
             "id":"5",
             "artist_id":"3",
             "name":"Pieces (extended)",
             "description":"Following directly on from both \"Icarus\" and his work for TV, film, and commercial use, \"Pieces\" is an exploration of Fielding's eclectic range of influences and inspirations. While maintaining a consistent aesthetic throughout, \"Pieces\" retains an incredibly earnest and varied impression of Fielding's writing and production styles, resulting in a collection of music that is as honest as it is diverse.\n\n\"Pieces\" is a compilation of previously unreleased works by UK-based musician and producer Adam Fielding, written and recorded during 2012-2014, and released in August 2014.\n\nFrom the euphoric, post-rock tinged opening of \"A Call To Action\" through to the moody, introspective electronic workings of \"Sleepless\", organic instrumentation combines with precise electronics to offer listeners a memorable melodic experience combined with lush atmospheric production on a truly epic scale.\n",
             "cover":"http:\/\/he3.magnatune.com\/music\/Adam Fielding\/Pieces (extended)\/cover_400.jpg",
             "cover_small":"http:\/\/he3.magnatune.com\/music\/Adam Fielding\/Pieces (extended)\/cover_200.jpg",
             "release_date":"1408086000",
             "popularity":"152"
          }
       ]
    },
    {
       "id":"4",
       "name":"Adriano Fontana",
       "description":"a trip with woodwinds and strings",
       "bio":"Born in Genoa, Adriano Fontana started to study classic guitar when he was 7 years old. He holds a Bachelor in guitar jazz from the Conservatory \"Niccolo Paganini\" in Genoa. Along with concert and didactic activity he composes music for theatre, contemporary dance, readings, short films, post-scorings and internet web-sites.\n\nAdriano plays mostly guitar (classical, electric and acoustic), but both in the composition and recording he also plays bass, double bass, piano, keyboards and percussion.\n\nHis album, \"Small songs in a small kitchen\" is the purely acoustic side of his production, based more on counterpoint and management of space and time rather than virtuosity. Fully recorded in a small kitchen in the historic center of Genoa (his house), it is a meeting place for actors, dancers and other performers. As an artist, Adriano is difficult to categorize, he professionally moves between classical music, jazz, contemporary and even rock and electronica.",
       "photo":"http:\/\/magnatune.com\/artists\/img\/adriano_fontana.jpg",
       "albums":[
          {
             "id":"6",
             "artist_id":"4",
             "name":"Small Songs in a Small Kitchen",
             "description":"Small songs in a small kitchen, a collection of themes composed and arranged for trio (guitar, cello and saxophone) by Adriano Fontana, can be described as the meeting between the rarefied atmosphere of Nordic jazz, contemporary music and song form.\n\nThe compositions were written during the last three years for theater shows, readings and musical performances and are now re-arranged in the form of \"small songs\" trio.\n\nThe sound is strictly acoustic from the three instruments. Their counterpoint and continuously research melody and rhythm are the main feature of the work, all recorded in a small kitchen in the historic center of Genoa.\n",
             "cover":"http:\/\/he3.magnatune.com\/music\/Adriano Fontana\/Small Songs in a Small Kitchen\/cover_400.jpg",
             "cover_small":"http:\/\/he3.magnatune.com\/music\/Adriano Fontana\/Small Songs in a Small Kitchen\/cover_200.jpg",
             "release_date":"1375686000",
             "popularity":"18"
          }
       ]
    }
 ]